<template>
  <div class="user-agreement">
    <div class="line">
      <div class="strong">
        欢迎您与OKSan伞（详见定义条款）共同签署本《OKSan伞用户协议》（下称“本协议”）并使用OKSan伞共享平台服务。
  各服务条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。
  【审慎阅读】您在借伞流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，您应重点阅读。如您对协议有任何疑问，可向OKSan伞共享平台客服咨询。
  【签约动作】当您按照页面提示完成借伞流程后，即表示您已充分阅读、理解并接受本协议的全部内容，并与OKSan伞达成一致，成为OKSan伞共享平台的用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止借伞程序。
      </div>
      <p class="font-orange">Oksan伞公司可能会根据需要不时修订或更新本协议，修订后的协议一经公布立刻取代原协议和文件，并自动生效，如果您不接受相关修订或更新，请立即停止借伞程序，如您继续使用完成借伞程序后，即表示您已经充分接受该修订和更新。</p>
    </div>
    <div class="line">
      <div class="strong">1、定义</div>
      <p>在本协议中，除非上下文有其他的规定，下列表达应作如下解释：
OKSan伞共享平台：指OKSan伞运营的互联网平台，以及其在iOS、Android、Windows等个人计算机或移动终端系统上的客户端。
OKSan伞：指OKSan伞共享平台的经营者。
用户：指具有民事行为能力的OKSan伞共享平台各项服务的使用者。
认证用户：指与OKSan伞签订《OKSan伞用户协议》并完成微信/支付宝授权流程的用户。一个认证用户仅可以拥有一个账户，每个账户对应唯一的用户名。
账户：指用户认证时设置的账户名，其账号具有唯一性。
租伞服务：指OKSan伞通过共享平台向认证用户提供租赁使用所有权归OKSan伞的伞的服务。OKSan伞和认证用户均应遵守《OKSan伞共享使用协议》对该等服务设定的权利义务。</p>
    </div>
    <div class="line">
      <div class="strong">2、协议范围</div>
      <p>签约主体：本协议由您与OKSan伞共享平台的经营者共同缔结，本协议对您与OKSan伞共享平台的经营者均具有合同效力。
补充协议：《OKSan伞共享隐私规则》、《OKSan伞共享使用协议》均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用OKSan伞共享平台，视为您同意上述补充协议。</p>
    </div>
    <div class="line">
      <div class="strong">3、用户注册与认证</div>
      <p>用户资格：您确认，在您开始用户认证程序从而具备使用OKSan伞共享平台服务的资格前，您应具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
        账户说明：您作为访客通过微信/支付宝等程序使用OKSan伞共享平台后，您即为OKSan伞共享平台的用户并拥有自己的账户。但是仅在完成了用户认证程序成为OKSan伞共享平台的认证用户后，您方可使用租伞服务。当您按照用户认证程序提示填写信息、阅读并同意本协议且完成全部认证程序后，您可获得OKSan伞共享平台认证用户账户。由于认证用户的账户关联认证用户的信用信息，您不得转让该账户，也不得许可或协助他人使用您的认证用户账户使用租伞服务，否则由此产生的一切责任均由您承担连带责任。
认证信息管理：在用户认证过程中，您应按OKSan伞共享平台页面的提示准确、真实、完整地提供您的信息（包括但不限于您的真实姓名、性别、身份证号等），以便OKSan伞确认身份信息。您了解并同意，您有义务保持您提供信息的真实性及有效性。如果您的认证信息有所变更，您应当及时更新您提供的信息，OKSan伞将依法不时地对您的信息进行检查核实，您应当配合提供最及时、真实、完整的信息。（如OKSan伞按您最后一次提供的信息与您联系未果、您未按OKSan伞的要求及时提供信息、您提供的信息存在明显不实的，您将承担因此对您自身、他人及OKSan伞造成的全部损失与不利后果。）
开通租伞权限：用户在成功通过用户认证程序后，即可按照《OKSan伞共享使用协议》租赁、使用OKSan伞共享平台所提供的伞。
认证用户：指与OKSan伞签订《OKSan伞用户协议》并完成微信/支付宝授权流程的用户。一个认证用户仅可以拥有一个账户，每个账户对应唯一的用户名。
上述用户认证的审核和通过均由OKSan伞最终决定。OKSan伞可以根据用户上传的文件对其文件的真实性、合法性进行合理的质询和怀疑，并给与用户不通过认证的结果而无需提供任何原因；用户可以通过再次申请认证或申诉进行重新认证。
      </p>
    </div>
    <div class="line">
      <div class="strong">4、账户安全规范</div>
      <p>您的账户为您自行设置并由您保管，OKSan伞任何时候均不会主动要求您提供您的账户信息。因此，请务必保管好您的账户，账户安全由您自行负责，请确保您在每个上网时段结束时退出登录并以正确步骤离开OKSan伞共享平台。如果您的账户因您主动泄露或遭受他人攻击、诈骗等行为而造成的任何损失及后果，该等损失和后果均由您自行承担。
除OKSan伞存在过错外，您应对您账户项下的所有行为和结果（包括但不限于租赁伞、退还伞、发布信息、披露信息、开放通讯录等）负责，无论该等行为和结果是否对您自身或第三方造成任何损害。
如发现任何未经授权使用您账户登录OKSan伞共享平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知OKSan伞共享平台。您理解OKSan伞对您的任何请求采取行动均需要合理时间，除OKSan伞存在过错外，OKSan伞对在采取行动前已经产生的后果不承担任何责任。</p>
    </div>
    <div class="line">
      <div class="strong">5、OKSan伞共享平台服务及规范</div>
      <p>经认证的用户可通过OKSan伞共享平台使用租伞服务。
        您应遵守《OKSan伞共享租伞规则》项下您的义务，您可行使《OKSan伞共享使用协议》项下您的权利。
您应确保您不会利用OKSan伞共享平台进行任何违法行为或下述行为：
1.利用技术手段故意访问、记录、盗取、传播OKSan伞共享平台的数据和相关信息；
2.以任何方式侵犯他人的合法权益；
3.干扰或破坏OKSan伞共享平台、其服务器或其网络；
4.未经合法授权而截取、篡改、收集、储存、使用、传播或删除其他用户的个人信息或提供的其他信息；
5.其他未经合法授权的行为。
您应确保您在OKSan伞共享伞平台上所发布和传播的内容不得包含下述信息：
1.违反宪法确定的基本原则的；
2.危害国家统一、主权和领土完整的；
3.泄露国家秘密，危害国家安全，损害国家荣誉和利益的；
4.煽动民族仇恨、民族歧视，破坏民族团结，侵害民族风俗、习惯的；
5.违背国家宗教政策，宣扬邪教、迷信的；
6.扰乱社会秩序，破坏社会稳定的；
7.宣扬淫秽、赌博、暴力、教唆犯罪的；
8.侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；
9.侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
10.存在可能破坏、篡改、删除、影响OKSan伞共享平台任何系统正常运行或未经授权秘密获取OKSan伞共享平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；
11.危害社会公德，诋毁民族优秀文化的；
12.不得利用OKSan伞共享平台系统进行任何损害OKSan公司的合法权益的行为。
13.有国家法律、法规或政策禁止的其他内容。
不可抗力：OKSan伞依法律规定承担基础保障义务，但无法对由于信息网络基础设施、信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。
      </p>
    </div>
    <div class="line">
      <div class="strong">6、用户信息的保护及授权</div>
      <p>OKSan伞非常重视您个人信息和其他用户信息的保护，在您使用OKSan伞共享平台的服务时，您同意OKSan伞按照在OKSan伞共享平台上公布的《OKSan伞共享隐私规则》收集、存储、使用、披露和保护您的个人信息或其他信息。OKSan伞希望通过《OKSan伞共享隐私规则》向您清楚地介绍OKSan伞对您个人信息的处理方式，因此OKSan伞建议您完整地阅读《OKSan伞共享隐私规则》，以帮助您更好地保护您的隐私权。
在任何情况下您使用OKSan伞共享平台，视为您同意遵守《OKSan伞共享隐私规则》下您的义务，允许OKSan伞行使《OKSan伞共享隐私规则》下OKSan伞的权利。
在您通过OKSan伞共享平台与他人沟通交流的过程中，如果您接触到其他用户的个人资料、信息、文件等，您保证您将严格保密，不以任何方式向任何第三方进行披露。
对于您提供及发布除个人信息外的文字、图片、视频、音频等非个人信息，在版权保护期内您免费授予OKSan伞获得全球的许可使用权。您同意OKSan伞存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的上述信息，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。</p>
    </div>
    <div class="line">
      <div class="strong">7、著作权</div>
      <p>您同意本协议并成为OKSan伞共享平台用户的行为，仅使得您本人得以按照本协议的规范使用OKSan伞共享平台的各项服务。您与OKSan伞共享平台或OKSan伞之间并不存在其他授权、合作、代理、委托、雇佣等关系。
您了解OKSan伞共享平台和相关专有保密资料的知识产权归属于OKSan伞。您了解OKSan伞共享平台上的任何赞助广告或信息的知识产权归属于相关赞助广告或信息的提供商。您了解并同意，未经知识产权所有人的书面明示授权，您不得对上述知识产权进行修改、出租、出借、出售、传播或实施其他侵犯上述知识产权的行为（例如进行还原工程、反向组译等）。<span class="font-orang">
未经OKSan伞公司书面同意，用户不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用转让知识产权。OKSan伞公司保留追究上述未经许可使用责任的权利。</span></p>
    </div>
    <div class="line">
      <div class="strong">8、责任的限制</div>
      <p>由于互联网服务实时更新的性质，您了解并同意，OKSan伞不对下述内容承担任何保证责任，对该等原因对您造成的任何损失，OKSan伞不承担任何责任：
1.OKSan伞共享平台服务不受任何干扰、服务提供及时、安全可靠、不出现任何差错；
2.使用OKSan伞共享平台服务所取得的信息在任何情况下均正确可靠；
3.您经由OKSan伞共享平台所租赁的伞符合您的期望；
通过OKSan伞共享平台下载或取得的任何资料不会导致您的个人电脑或移动设备有任何损坏或数据有任何流失。
OKSan伞负责「按现状」和「可得到」的状态向您提供OKSan伞共享平台的服务。除本协议内所做出的保证或OKSan伞以书面形式做出的其他明示保证外，OKSan伞未向您做出任何形式的保证或承诺，包括但不限于商业适售性、特定目的之适用性或其他明示或暗示的保证。
<span class="font-orange">4.如用户在使用共享雨伞服务过程中，不幸发生任何事故，OKSan伞公司不承担任何法律责任。</span>
</p>
    </div>
    <div class="line">
      <div class="strong">9、用户的行为的评价及处理</div>
      <p>跟踪评价：为了向用户提供更加优质的服务，且为维持市场正常运营秩序，OKSan伞有权对认证用户使用租伞服务的行为，进行跟踪监测和评价，并根据评价结果增减该认证用户使用租伞服务的费用。
违约认定：发生如下情形之一的，视为您违约
1.如OKSan伞在用户认证信息复核过程中发现用户提供的认证信息不全、无效或虚假；
2.如用户发生危及交易安全或账户安全的行为；
3.如用户采用不正当手段谋取利益的行为，包括向OKSan伞工作人员及其关联人士提供财物、消费、款待或商业机会，或通过其他手段谋取不正当利益；
4.如用户扰乱OKSan伞共享平台的秩序，以任何方式，刻意规避OKSan伞共享平台的各类规则或市场管控措施，或以不正当的方式获取、使用OKSan伞共享平台资源的行为；
5.如用户违反中国相关法律法规的规定；
6.如用户违反本协议的其他规定。
为适应互联网平台发展和满足海量用户对高效优质服务的需求，您理解并同意，OKSan伞可在OKSan伞共享平台规则中约定违约认定的程序和标准。如：OKSan伞可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。
为保障其他用户或OKSan伞共享平台的正当权益，维持市场正常运营秩序，在用户违规处理期间OKSan伞按照本规则规定的情形对用户采取违规处理措施，OKSan伞没有义务在采取违规处理前通知用户：
1.停止租伞服务：指停止认证用户通过OKSan伞共享平台租赁使用伞的权利；
2.关闭账户：指删除用户的账户或停止用户的所有权限，并将用户列入黑名单，不再向用户提供任何服务；
3.公示警告：指在OKSan伞共享平台的管理系统等位置对其正在被执行的处理进行公示；
终止本协议。
OKSan伞可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在OKSan伞共享平台上予以公示。赔偿责任：如您的行为使OKSan伞遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿OKSan伞的上述全部损失。
如您的行为使OKSan伞遭受第三人主张权利，OKSan伞可在对第三人承担金钱给付等义务后就全部损失向您追偿。如您向OKSan伞的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，OKSan伞可立即终止与您的所有合作并向您收取违约金或赔偿金，该等金额以OKSan伞因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。</p>
    </div>
    <div class="line">
      <div class="strong">10、协议的变更</div>
      <p>由于互联网的高速发展，OKSan伞保留不经事先通知为维修、升级或其他目的暂停或更改本服务任何部分的权利。
OKSan伞可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议第11条约定的方式通知您。
如您不同意变更事项，您有权于变更事项确定的生效日前联系OKSan伞反馈意见。如反馈意见得以采纳，OKSan伞将酌情调整变更事项。
如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用OKSan伞共享平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用OKSan伞共享平台服务，则视为您同意已生效的变更事项。<span class="font-orange">鉴于服务的特殊性，用户同意OKSan伞公司有权随时变更，中断或终止部分或全部的服务（包括收费服务和免费服务）。</span></p>
    </div>
    <div class="line">
      <div class="strong">11、通知</div>
      <p>您同意OKSan伞以以下合理的方式向您送达各类通知：
1.OKSan伞共享平台公示的文案；
2.站内短信、OKSan伞共享平台弹出消息、客户端推送的消息；
3.根据您预留于OKSan伞共享平台的联系方式发出的电子邮件、短信、函件等。</p>
    </div>
    <div class="line">
      <div class="strong">12、协议的终止</div>
      <p>用户发起的终止：您有权通过以下任一方式终止本协议
1.您不再继续使用OKSan伞共享平台服务；
2.变更事项生效前您停止使用并明示不愿接受变更事项的。OKSan伞发起的终止：出现以下情况时，OKSan伞可以本协议第11条的所列的方式通知您终止本协议
1.您违反本协议约定，OKSan伞依据违约条款终止本协议的；
2.您的用户行为存在异常，OKSan伞合理怀疑您可能存在违反本协议约定的行为，如果不终止本协议则可能对OKSan伞共享平台或其他用户造成不利影响的；
3.您盗用他人账户、发布违禁信息、骗取他人财物、采取不正当手段谋利等行为，OKSan伞依据本协议对您的账户予以查封的；
4.除上述情形外，因您多次违反OKSan伞共享平台相关规定且情节严重，OKSan伞依据本协议对您的账户予以查封
协议终止后的处理：本协议终止后，除法律有明确规定外，OKSan伞无义务向您或您指定的第三方披露您账户中的任何信息。
本协议终止后，OKSan伞仍享有下列权利：
1.继续保存您留存于OKSan伞共享平台的各类信息；
2.对于您过往的违约行为，OKSan伞仍可依据本协议向您追究违约责任。</p>
    </div>
    <div class="line">
      <div class="strong">13、法律适用、管辖与其他</div>
      <p>【法律适用】本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例或行业惯例。
【管辖】您因使用OKSan伞共享平台服务所产生及与OKSan伞共享伞平台服务有关的争议，由OKSan伞与您协商解决。协商不成时，任何一方均在北京可向中国国际经济贸易仲裁委员会提起仲裁；仲裁结果具有终局性，对双方均有约束力。
【可分性】本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
【标题】本协议的标题仅供阅读方便而设，不属于协议的条款，不具有任何法律效果。
【非弃权】任何一方当事人放弃或者延迟行使其在本协议项下的全部或部分权利的，不应视为其放弃本协议项下的任何其他权利或与此类似的一切权利。
【完全合意】本协议构成各方之间就本协议内容所达成的完全合意；本协议签署前存在的、或与本协议相矛盾或抵触的一切合意，无论其为口头、书面或其他形式均归于无效。
【部分条款无效】如果本协议及其附件的任何条款因适用法律而无效或不可强制执行，则该条款应视为自始无效，且不影响本协议其他条款的效力。在此情形下，各方应当在合法范围内协商确定新的条款，以保证最大限度地实现原有条款的意图。<span class="font-orange">本协议中的标题仅为方便而设，在解释本协议时不应受标题的限制。</span></p>
    </div>
  </div>
</template>

<style scoped>
.user-agreement{
  box-sizing: border-box;
  padding: 40px;
  height: 100%;
  overflow: auto;
  -webkit-overflow-scrolling: touch;
  overflow-scrolling: touch;
  text-align: justify;
}
.user-agreement .line{
  margin-bottom: 40px;
}
.user-agreement .strong{
  font-weight: bold;
}
.user-agreement .font-orange{
  color: rgb(240,90,0)
}
</style>
