<template>
	<div class="share-agreement">
		<div class="line">
			<div class="strong">1、总则</div>
			<p>OKSan伞根据以下服务条款为您提供服务,这些条款可随时更新。使用协议（以下简称“使用协议”）一旦发生变动，将在网页上公布修改内容，一经公布，即有效代替原来的使用协议。
				您在使用OKSan伞提供的服务前，应仔细阅读本使用协议。如您不同意本使用协议或随时对其的修改，请您立即停止使用OKSan伞所提供的全部服务；您一旦使用服务，即视为您已了解并完全同意本使用协议各项内容，包括OKSan伞对使用协议随时所做出的任何修改，并视为您已成为用户（以下简称“用户”）。
			</p>
		</div>
		<div class="line">
			<div class="strong">2、服务说明</div>
			<p>目前OKSan伞向用户提供使用共享伞便民的服务。除非本使用协议另有其它明示规定，增加或强化目前本服务的任何新功能，包括所推出的新产品，均受到本使用协议之规范。您了解并同意，本服务仅依其当前所呈现的状况提供，对于任何用户信息设定之时效、删除、传递错误、未予储存或其它任何问题，OKSan伞均不承担任何责任。OKSan伞保留不经事先通知为维修、升级或其它目的暂停本服务任何部分的权利。</p>
		</div>
		<div class="line">
			<div class="strong">3、遵守法律</div>
			<p>您同意遵守中华人民共和国相关法律法规的所有规定，并对以任何方式通过使用您的密码和您的帐号使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，或有可能构成犯罪将被追究刑事责任的，将由您承担全部法律责任。
同时如果有理由认为您的任何行为违反或可能违反国家法律和法规的任何规定，OKSan伞可在任何时候不经任何事先通知终止向您提供服务。</p>
		</div>
		<div class="line">
			<div class="strong">4、您的注册义务</div>
			<p>为了能使用本服务，您同意以下事项：依本服务提示，允许获取微信/支付宝基础资料及权限等，并确保今后更新的资料的有效性和合法性。若您提供任何违法、不道德；或者有理由怀疑你的资料属于程序或恶意操作，OKSan伞有权暂停或终止您的帐号，并拒绝您于现在和未来使用本服务之全部或任何部分。
				OKSan伞无须对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性及是否为最新资料的责任。
			</p>
		</div>
		<div class="line">
			<div class="strong">5、用户帐号、密码及安全</div>
			<p>完成本服务的授权程序后，您可使用您的微信/支付宝，登录到您的帐号（下称“帐号”）。保护您的帐号安全，是您的责任。您应对所有使用您的密码及帐号的活动负完全的责任。您同意：
1.您的帐号遭到未获授权的使用，或者发生其它任何安全问题时，您应立即通知OKSan伞，您通知之前所产生的所有后果由您自行承担；
2.如果您未保管好自己的帐号，因此而产生的任何损失或损害，OKSan伞无法承担也不承担任何责任；
3.每个用户都要对其帐号中的所有行为和事件负全责。如果您未保管好自己的帐号而对您、或第三方造成的损害，您将负全部责任。</p>
		</div>
		<div class="line">
			<div class="strong">6、隐私权政策</div>
			<p>您提供的登记资料及保留的有关您的若干其它资料将受到中国有关隐私的法律和本公司《OKSan伞共享隐私规则》之规范。</p>
		</div>
		<div class="line">
			<div class="strong">7、提供者之责任</div>
			<p>根据有关法律法规，在此郑重提请您注意，任何经由本服务而发布、上传的文字、资料、图形或其它资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。OKSan伞仅为用户提供信息展示空间，无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性。</p>
		</div>
		<div class="line">
			<div class="strong">8、用户资格及行为</div>
			<p>您确认，您应具备中华人民共和国法律规定的与您行为相适应的民事行为能力人士。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
您同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶
1.利用技术手段故意访问、记录、传播OKSan伞相关信息， OKSan伞会通过数据监测异常访问的行为，并保留追加惩罚的权利；
2.以任何方式危害他人的合法权益；
3.干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；
4.故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；
5.未经合法授权而截获、篡改、收集、储存或删除他人个人信息或其它数据资料，或将获知的此类资料用于任何非法或不正当目的；
6.故意、恶意破坏、损毁、盗窃共享伞及共享伞附着硬件。
您了解并同意，依据法律法规的要求，或基于诚信为了以下目的或在合理必要范围内，必须将内容加以保存或揭露时，OKSan伞可加以保存或揭露：
1.遵守法律程序；
2.执行本使用协议；
3.回应任何第三人提出的权利主张；
4.保护、其用户及公众之权利、财产或个人安全；
5.其它认为有必要的情况</p>
		</div>
		<div class="line">
			<div class="strong">9、免责声明</div>
			<p>用户明确同意其将文字、资料、照片、信息或其它个人资料上传到互联网上，有可能被其他组织或个人复制、转载、或做其它用途的风险完全由其自己承担；因其使用服务而产生的一切后果也由其自己承担，我们对用户不承担任何责任。
微信、支付宝、微博等官方帐号对用户的相关文字、资料、照片、图形或其它个人资料进行推广发布的，不属于对用户相关权益的侵权行为，我们对用户不承担任何责任。</p>
		</div>
		<div class="line">
			<div class="strong">10、赔偿</div>
			<p>由于您通过本服务提供、发布或传送之内容、您与本服务连线、您违反本使用协议、或您侵害他人任何权利因而衍生或导致任何第三人提出任何索赔或请求，包括合理的律师费，您同意赔偿OKSan伞，并使其免受损害，且承担由此引发的全部法律责任。</p>
		</div>
		<div class="line">
			<div class="strong">11、禁止商业行为</div>
			<p>
				您同意不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。
			</p>
		</div>
		<div class="line">
			<div class="strong">12、服务之修改</div>
			<p>
				OKSan伞有权于任何时间暂时或永久修改或终止本服务（或其任何部分），且无论通知与否。您同意OKSan伞对于本服务所作的任何修改、暂停或终止，对您和任何第三人均无需承担任何责任。
			</p>
		</div>
		<div class="line">
			<div class="strong">13、终止服务</div>
			<p>
				您同意OKSan伞基于其自行之考虑，因任何理由，包含但不限于您缺乏使用，或认为您已经违反本使用协议的文字及精神，终止您的帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意OKSan伞依本使用协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，OKSan伞可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，及禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，OKSan伞对您或任何第三人均不承担任何责任。
			</p>
		</div>
		<div class="line">
			<div class="strong">14、与广告商及其他第三方进行交易</div>
			<p>
				您通过本网站与广告商及其他第三方进行任何形式的通讯或商业往来，或参与促销活动，包含相关商品或服务之付款及交付，以及达成的其它任何相关条款、条件、保证或声明，完全为您与广告商及其他第三方之间之行为。对您因前述任何交易或前述广告商及其他第三方而遭受的任何性质的损失或损害，OKSan伞不负任何法律责任。
			</p>
		</div>
		<div class="line">
			<div class="strong">15、OKSan伞共享之专属权利</div>
			<p>
				您了解并同意，本服务及本服务所使用之相关软件（以下简称“软件”）含有受到相关知识产权及其它法律保护之专有保密资料。您也了解并同意，经由本服务或广告商向您呈现之赞助广告或信息所包含之内容，亦受到著作权、商标权、服务商标、专利权或其它专属权利之法律保护。未经广告商明示授权，您不得修改、出租、出借、出售、散布本服务或软件之任何部份或全部，或据以制作衍生作品，或使用擅自修改后的软件，包括但不限于为了未经授权而使用本服务之目的。OKSan伞仅授予您个人、不可移转的普通使用权，使您可以为享用OKSan伞提供之共享伞服务使用其软件，但您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向组译，或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。您同意将通过所提供的界面而非任何其它途径使用本服务。
			</p>
		</div>
		<div class="line">
			<div class="strong">16、担保与保证</div>
			<p>
				您使用本服务之风险由您个人负担。本服务系依“现状”及“现有”基础提供。对本服务OKSan伞不提供任何明示或默示的担保或保证，包含但不限于商业适售性、特定目的之适用性及未侵害他人权利等担保或保证；
			</p>
		</div>
		<div class="line">
			<div class="strong">17、OKSan伞不保证以下事项：</div>
			<p>
				1.本服务将符合您的要求；
2.本服务将不受干扰、及时提供、安全可靠或不会出错；
3.使用本服务取得之结果正确可靠；
4.您经由本服务购买或取得之任何产品、服务、资讯或其它信息将符合您的期望；
5.是否使用本服务下载或取得任何资料应由您自行考虑且自负风险，因任何资料之下载而导致的您手机之任何损坏或数据流失等后果，由您自行承担；
6.您自行或经由本服务取得的任何建议或信息，无论是书面或口头形式，除非本使用协议有明确规定，将不构成本使用协议以外之任何保证；
7.如果合作单位使用您提供的肖像、姓名或其他合法权益，您同意将您的肖像、姓名或其他合法权益一并授权给合作单位使用。
<span class="font-orange">
	8.OKSan伞公司对服务不做任何类型的担保，包括但不限于服务的及时性、安全性、准确性。对任何情况下因使用或不能使用服务所产生的直接、间接、偶然特殊及后续的损害及风险，OKSan伞公司不承担任何责任。
</span>
			</p>
		</div>
		<div class="line">
			<div class="strong">18、责任限制</div>
			<p>
				您明确了解并同意，基于以下原因而造成的，包括但不限于利润、信誉、应用、数据损失或其它无形损失，OKSan伞不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿责任：
1.本服务之使用或无法使用；
2.为替换从或通过本服务购买或取得之任何商品、数据、信息、服务，收到的讯息，或缔结之交易而发生的成本；
3.您的传输或数据遭到未获授权的存取或变造；
4.任何第三方在本服务中所作之声明或行为；
5.与本服务相关的其它事宜，但本使用协议有明确规定的除外；
6.第三方以任何方式发布或投递欺诈性信息，或诱导用户受到经济损失。
			</p>
		</div>
		<div class="line">
			<div class="strong">19、商标信息</div>
			<p>
				未经事先书面同意，您同意不将OKSan伞及OKSan伞的其他注册商标、标志及产品、服务名称以任何方式展示或使用或作其它处理，或表示您有权展示、使用或另行处理标记。
			</p>
		</div>
		<div class="line">
			<div class="strong">20、一般条款</div>
			<p>
				本使用协议和免责声明构成您与之协议，并规范您对于本服务之使用行为。在您使用相关服务、使用第三方提供的内容或软件时，亦应遵从所适用之附加条款及条件；
本使用协议及您与之关系，均受到中华人民共和国法律管辖。您与就本服务、本使用协议或其它有关事项发生的争议，应首先友好协商解决，协商不成时应提请法院管辖，对双方均有约束力；
未行使或执行本使用协议任何权利或规定，不构成对前述权利或权利之放弃；
倘本使用协议之任何规定因与中华人民共和国法律抵触而无效，您依然同意应依照法律，努力使该规定所反映之当事人意向具备效力，且本使用协议其它规定仍应具有完整的效力及效果；
本使用协议之标题仅供方便而设，不具任何法律或契约效果；
只要您使用OKSan伞服务，就代表您认可以上所有协议。
OKSan伞对本使用协议享有最终解释权。
			</p>
		</div>
	</div>
</template>

<style scoped>
.share-agreement{
	padding: 40px;
}
.share-agreement .line{
	margin-bottom: 40px;
}
.share-agreement .strong{
	font-weight: bold;
}
.share-agreement .font-orange{
	color: rgb(240,90,0)
}
</style>
