<template>
  <div class="recharge-agreement">
    <div class="line strong">
      尊敬的用户，为保障您的合法权益，请您在充值前仔细阅读本《充值协议》（“本协议”）以了解OKSan伞的充值、提现及押金余额使用规则并避免产生任何误解。当您点击“充值”按钮，即视为您已阅读、理解本协议，并同意按照本协议约定的规则进行充值、参与提现及使用账户押金余额。
    </div>
    <div class="line">
      <div class="strong">1、定义</div>
      <p>
        <span class="strong">账户充值：</span>
        <span>
          您通过“OKSan共享雨伞”微信公众号向您的用户帐号实际支付的金额
        </span>
      </p>
      <p>
        <span class="strong">账户钱包：</span>
        <span>您的用户帐号中显示的金额，包括余额、押金及充值返现的金额</span>
      </p>
      <p>
        <span class="strong">钱包余额：</span>
        <span>您的钱包中可提现的金额，充值成功后，余额相应增加</span>
      </p>
      <p>
        <span class="strong">钱包押金：</span>
        <span>为保障双方的利益，借伞过程中系统会将您的部分余额自动转为押金，当您完成还伞操作时，押金将自动转为余额</span>
      </p>
    </div>
    <div class="line">
      <div class="strong">
        2、钱包有效期
      </div>
      <p>用户账户余额的有效期为自充值之日起至使用完毕为止</p>
    </div>
    <div class="line">
      <div class="strong">3、充值返现活动规则</div>
      <p>我们会通过充值页面或具体活动页面及时公布不同数额的充值本金可享受的返现金额，您可通过充值或关注我们的活动页面了解详情</p>
    </div>
    <div class="line">
      <div class="strong">4、钱包的使用规则</div>
      <p>1.钱包余额可用于支付押金，借伞过程中系统会将您的部分余额自动转为押金。</p>
      <p>2.钱包余额可用于支付用伞费用，还伞成功后，押金将自动转为余额,用伞费用将从余额中扣除。</p>
      <p>3.用户帐号使用期间，余额与押金之间的转换由系统自动进行</p>
      <p>4.余额可申请提现，押金不可提现。关于余额的退还，如需帮助请联系 18859599189，并提供您的个人信息，我们会及时为您处理。</p>
      <p>5.返现金额仅可用于支付用伞费，不可用于支付押金、转移、转赠或退款</p>
      <p>6.鉴于返现金额是以您账户可合法有效使用为前提条件，返现金额在如下情形下将会失效</p>
      <p>Ⅰ.您主动注销用户账号</p>
      <p>II.因涉嫌作弊导致您的用户账号被冻结或关闭</p>
      <p>III.其它根据用户协议、相关说明或规则导致我们无法向您提供或停用服务的情形</p>
    </div>
    <div class="line">
      <div class="strong">5、保证与承诺</div>
      <p>您完全理解并同意，OKSan伞所提供的包括“充值返现”在内与充值相关的优惠活动仅适用于正当、合法按照《用户协议》使用我们服务的用户。一旦发现您的用户帐号存在任何利用前述规则从事作弊行为以获取不正当经济利益的情形，OKSan伞有权冻结或关闭您的用户账号以及任何其他与作弊行为相关的用户帐号、收回或取消已赠送的返现金额及追回因作弊行为取得的所有不正当的经济利益，并且OKSan伞保留停止向您提供服务以及根据作弊行为的严重程度进一步追究法律责任的权利。</p>
    </div>
    <div class="line">
      <div class="strong">6、特别说明</div>
      <p>您完全理解并同意，OKSan伞有权随时修改本协议内容，届时将通过在官网或“OKSan伞”微信公众号/支付宝服务号上公布修改后的协议，该公布将被视为OKSan伞已通知用户；同时，OKSan伞也可通过其他适当方式通知用户。如果您选择继续充值即表示您同意并接受修改后的协议并受其约束；如果您不同意我们对本协议的修改，请立即放弃充值或停止使用本服务。
在适用法律法规允许的范围内，本协议下充值、返现及账户余额的使用规则的最终解释权归OKSan伞所有。</p>
    </div>
  </div>
</template>

<style scoped>
.recharge-agreement{
  padding: 30px;
  line-height: 1.5;
  font-size: 22px; /*px*/
}
.recharge-agreement .line{
  margin-bottom: 40px;
}
.recharge-agreement .strong{
  font-weight: bold;
}
</style>
